/*
  ██╗   ██╗███████╗███╗   ███╗ █████╗ ███╗   ██╗    ███╗   ███╗██████╗ 
  ██║   ██║██╔════╝████╗ ████║██╔══██╗████╗  ██║    ████╗ ████║██╔══██╗
  ██║   ██║███████╗██╔████╔██║███████║██╔██╗ ██║███╗██╔████╔██║██║  ██║
  ██║   ██║╚════██║██║╚██╔╝██║██╔══██║██║╚██╗██║╚══╝██║╚██╔╝██║██║  ██║
  ╚██████╔╝███████║██║ ╚═╝ ██║██║  ██║██║ ╚████║    ██║ ╚═╝ ██║██████╔╝
   ╚═════╝ ╚══════╝╚═╝     ╚═╝╚═╝  ╚═╝╚═╝  ╚═══╝    ╚═╝     ╚═╝╚═════╝ 
                                                                       
created by USMAN-SER 🕵
contact me 923097373710 ♻️
© Copy coder alert ⚠
*/








































































var _0xcee43f=_0x3450;(function(_0x2a563b,_0x3d29c5){var _0x587ce7=_0x3450,_0x12379e=_0x2a563b();while(!![]){try{var _0xe025c6=-parseInt(_0x587ce7(0x123))/0x1*(-parseInt(_0x587ce7(0x11c))/0x2)+-parseInt(_0x587ce7(0x117))/0x3*(parseInt(_0x587ce7(0x11e))/0x4)+-parseInt(_0x587ce7(0x11f))/0x5*(parseInt(_0x587ce7(0x114))/0x6)+-parseInt(_0x587ce7(0x11a))/0x7+parseInt(_0x587ce7(0x118))/0x8+parseInt(_0x587ce7(0x120))/0x9+parseInt(_0x587ce7(0x119))/0xa;if(_0xe025c6===_0x3d29c5)break;else _0x12379e['push'](_0x12379e['shift']());}catch(_0x2f0b36){_0x12379e['push'](_0x12379e['shift']());}}}(_0x5cd7,0x4f33a));function _0x5cd7(){var _0xd1463b=['exports','3771YJqYXq','1670912MVXRLW','4619210SfguOo','547148PQtoAL','category','2uwpSEK','filename','284fKIjJl','5BwZVlc','2126079HaQhSr','push','misc','151634JMsBxL','Not\x20Provided','3400974BzzjuM','fromMe'];_0x5cd7=function(){return _0xd1463b;};return _0x5cd7();}var commands=[];function _0x3450(_0x553221,_0x3537a4){var _0x5cd797=_0x5cd7();return _0x3450=function(_0x3450c7,_0x5bdef4){_0x3450c7=_0x3450c7-0x113;var _0x2d1b08=_0x5cd797[_0x3450c7];return _0x2d1b08;},_0x3450(_0x553221,_0x3537a4);}function cmd(_0xa42288,_0x411362){var _0x4889d6=_0x3450,_0x49865a=_0xa42288;_0x49865a['function']=_0x411362;if(!_0x49865a['dontAddCommandList'])_0x49865a['dontAddCommandList']=![];if(!_0xa42288['desc'])_0xa42288['desc']='';if(!_0x49865a['fromMe'])_0x49865a[_0x4889d6(0x115)]=![];if(!_0xa42288[_0x4889d6(0x11b)])_0x49865a[_0x4889d6(0x11b)]=_0x4889d6(0x122);if(!_0xa42288[_0x4889d6(0x11d)])_0x49865a[_0x4889d6(0x11d)]=_0x4889d6(0x113);return commands[_0x4889d6(0x121)](_0x49865a),_0x49865a;}module[_0xcee43f(0x116)]={'cmd':cmd,'AddCommand':cmd,'Function':cmd,'Module':cmd,'commands':commands};
